{
  "Conditions": {
    "Applications": {
      "ApplicationFilter": {
        "Mode": null,
        "Rule": null
      },
      "ExcludeApplications": [
        "0000000a-0000-0000-c000-000000000000",
        "d4ebce55-015a-49b5-a083-c84d1797ae8c",
        "a31f3d96-f709-4fc9-bbef-c89e42ff8050",
        "98ca3b7d-f505-4b62-8a25-cbf42685fccd",
        "17395087-3693-402a-9d8b-7b1420a029d9",
        "51a28859-6a8e-44bf-b744-821936b954f5",
        "cd7549f0-5481-4774-b7e4-42ebadfb4678",
        "d5fd9de2-e429-4663-86a2-bddd79e45340",
        "81f061f1-a7c8-4951-9516-356d75587fa1",
        "a7ec4553-515f-4415-87d4-a11469f3151d",
        "c12f8fd7-a93c-495f-832e-c3b866d905ff",
        "d750a102-0777-4650-9454-8637f4746edb",
        "15074c5f-2164-4059-8e5e-f708d857b8c3",
        "441f3157-436c-499a-8c01-e31f8feb01c3",
        "640b5f29-5a76-4df3-8e01-b614c2f8092a",
        "e49a3280-b978-4aef-9381-4f9af18eae05",
        "0340be91-f819-4e55-a379-6588d1946f22",
        "c8ede07a-2b52-46b9-a6c3-8ecb918c68de",
        "f37d1238-abc2-40b3-8481-ebfd02ff2896",
        "49089f60-9e99-487b-a18a-2b97a37b599e",
        "d6df7966-7b58-4b45-9b2f-c28fc3472426",
        "8add8a7c-3672-4537-86bc-d3af511a0cdf",
        "455ac4d3-5cda-4c21-ac00-ce190c5baeeb",
        "d70bed3d-d79f-49e9-b65d-e4250535eb23",
        "8dcb5303-1ee4-45f2-b090-56b4be502436",
        "12d367b4-cc53-47db-9a21-e39a6ae7e00d",
        "ce914189-228d-4ef5-9f51-618f4e40394d",
        "b7bb06cb-c95d-493b-a03a-79f9e7d4d290",
        "5a6de796-a648-4cd1-837c-b2d302ade6b7",
        "b33060de-1de5-4037-9b28-4e0a61ac655d",
        "375f3113-7e25-4fe7-b256-c83bbf91e33d",
        "a53a08ef-c3c2-4bbb-9f7b-09ea7f6a69b0",
        "2aa75f4d-3bd7-4c0c-a30e-7b5ba5816700",
        "754e579c-da50-44d4-9027-95d6c8961147",
        "dc82a09b-947f-464f-ab09-b4cf6197b34e",
        "31f652a7-6f6f-4294-95e9-aabb6d919df2",
        "341deead-46b5-43db-9e93-17fcca98ba09",
        "4eacc60d-8c5a-462a-a5a3-08364310edd6",
        "3238b024-efdc-4a0d-9cce-81c65d92bcb0",
        "bf1a86cd-6211-4689-b690-911c12d5d8e2",
        "529348d0-453c-436d-9cf3-747e4c09470a"
      ],
      "IncludeApplications": [
        "All"
      ],
      "IncludeAuthenticationContextClassReferences": [],
      "IncludeUserActions": []
    },
    "AuthenticationFlows": {
      "TransferMethods": null
    },
    "ClientAppTypes": [
      "all"
    ],
    "ClientApplications": {
      "ExcludeServicePrincipals": null,
      "IncludeServicePrincipals": null,
      "ServicePrincipalFilter": {
        "Mode": null,
        "Rule": null
      }
    },
    "Devices": {
      "DeviceFilter": {
        "Mode": null,
        "Rule": null
      }
    },
    "InsiderRiskLevels": null,
    "Locations": {
      "ExcludeLocations": null,
      "IncludeLocations": null
    },
    "Platforms": {
      "ExcludePlatforms": null,
      "IncludePlatforms": null
    },
    "ServicePrincipalRiskLevels": [],
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": [
        "d01fa477-f6c1-4e8c-bd6b-c10b1edabaf7"
      ],
      "ExcludeGuestsOrExternalUsers": {
        "ExternalTenants": {
          "MembershipKind": null
        },
        "GuestOrExternalUserTypes": null
      },
      "ExcludeRoles": [
        "d29b2b05-8046-44ba-8758-1e26182fcf32"
      ],
      "ExcludeUsers": [
        "8dab5fa8-e1a1-4056-adbc-9efdbfd51af9"
      ],
      "IncludeGroups": [],
      "IncludeGuestsOrExternalUsers": {
        "ExternalTenants": {
          "MembershipKind": null
        },
        "GuestOrExternalUserTypes": null
      },
      "IncludeRoles": [],
      "IncludeUsers": [
        "All"
      ]
    }
  },
  "CreatedDateTime": "2025-04-11T13:22:55.4652468Z",
  "Description": null,
  "DisplayName": "CAP00 - All Resources: Require MFA for all users",
  "GrantControls": {
    "AuthenticationStrength": {
      "AllowedCombinations": [
        "windowsHelloForBusiness",
        "fido2",
        "temporaryAccessPassOneTime",
        "password,microsoftAuthenticatorPush",
        "password,softwareOath",
        "password,hardwareOath"
      ],
      "CombinationConfigurations": [
        {
          "AppliesToCombinations": [
            "fido2"
          ],
          "Id": "7313bdbd-3952-48d8-bbf7-329d8dadb4e2"
        }
      ],
      "CreatedDateTime": "2025-05-15T13:04:34.7433055Z",
      "Description": "Requirements for GSA MFA",
      "DisplayName": "GS MFA",
      "Id": "e3027f75-f48f-4696-ae56-361d03afc308",
      "ModifiedDateTime": "2025-07-07T14:12:08.9826826Z",
      "PolicyType": "custom",
      "RequirementsSatisfied": "mfa"
    },
    "BuiltInControls": [],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": []
  },
  "Id": "0ec23909-7f4f-465d-a1e9-40da33371609",
  "ModifiedDateTime": "2025-09-10T19:18:46.0480536Z",
  "SessionControls": {
    "ApplicationEnforcedRestrictions": {
      "IsEnabled": null
    },
    "CloudAppSecurity": {
      "CloudAppSecurityType": null,
      "IsEnabled": null
    },
    "DisableResilienceDefaults": null,
    "PersistentBrowser": {
      "IsEnabled": null,
      "Mode": null
    },
    "SecureSignInSession": {
      "IsEnabled": null
    },
    "SignInFrequency": {
      "AuthenticationType": "primaryAndSecondaryAuthentication",
      "FrequencyInterval": "timeBased",
      "IsEnabled": true,
      "Type": "days",
      "Value": 30
    }
  },
  "State": "enabled",
  "TemplateId": null,
  "AdditionalProperties": {
    "@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies/$entity"
  }
}
