{
  "Conditions": {
    "Applications": {
      "ApplicationFilter": {
        "Mode": null,
        "Rule": null
      },
      "ExcludeApplications": [],
      "IncludeApplications": [
        "All"
      ],
      "IncludeAuthenticationContextClassReferences": [],
      "IncludeUserActions": []
    },
    "AuthenticationFlows": {
      "TransferMethods": null
    },
    "ClientAppTypes": [
      "exchangeActiveSync",
      "other"
    ],
    "ClientApplications": {
      "ExcludeServicePrincipals": null,
      "IncludeServicePrincipals": null,
      "ServicePrincipalFilter": {
        "Mode": null,
        "Rule": null
      }
    },
    "Devices": {
      "DeviceFilter": {
        "Mode": null,
        "Rule": null
      }
    },
    "InsiderRiskLevels": null,
    "Locations": {
      "ExcludeLocations": null,
      "IncludeLocations": null
    },
    "Platforms": {
      "ExcludePlatforms": null,
      "IncludePlatforms": null
    },
    "ServicePrincipalRiskLevels": [],
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": [],
      "ExcludeGuestsOrExternalUsers": {
        "ExternalTenants": {
          "MembershipKind": null
        },
        "GuestOrExternalUserTypes": null
      },
      "ExcludeRoles": [],
      "ExcludeUsers": [],
      "IncludeGroups": [],
      "IncludeGuestsOrExternalUsers": {
        "ExternalTenants": {
          "MembershipKind": null
        },
        "GuestOrExternalUserTypes": null
      },
      "IncludeRoles": [],
      "IncludeUsers": [
        "All"
      ]
    }
  },
  "CreatedDateTime": "2025-04-11T13:25:47.3452551Z",
  "Description": null,
  "DisplayName": "CAP02 - All Resources: Block legacy authentication",
  "GrantControls": {
    "AuthenticationStrength": {
      "AllowedCombinations": null,
      "CombinationConfigurations": null,
      "CreatedDateTime": null,
      "Description": null,
      "DisplayName": null,
      "Id": null,
      "ModifiedDateTime": null,
      "PolicyType": null,
      "RequirementsSatisfied": null
    },
    "BuiltInControls": [
      "block"
    ],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": []
  },
  "Id": "bbe74c8c-0955-4f17-af2a-c13d211a8cba",
  "ModifiedDateTime": "2025-07-10T19:15:24.143514Z",
  "SessionControls": {
    "ApplicationEnforcedRestrictions": {
      "IsEnabled": null
    },
    "CloudAppSecurity": {
      "CloudAppSecurityType": null,
      "IsEnabled": null
    },
    "DisableResilienceDefaults": null,
    "PersistentBrowser": {
      "IsEnabled": null,
      "Mode": null
    },
    "SecureSignInSession": {
      "IsEnabled": null
    },
    "SignInFrequency": {
      "AuthenticationType": null,
      "FrequencyInterval": null,
      "IsEnabled": null,
      "Type": null,
      "Value": null
    }
  },
  "State": "enabled",
  "TemplateId": null,
  "AdditionalProperties": {
    "@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies/$entity"
  }
}
