{
  "Conditions": {
    "Applications": {
      "ApplicationFilter": {
        "Mode": null,
        "Rule": null
      },
      "ExcludeApplications": [],
      "IncludeApplications": [
        "All"
      ],
      "IncludeAuthenticationContextClassReferences": [],
      "IncludeUserActions": []
    },
    "AuthenticationFlows": {
      "TransferMethods": null
    },
    "ClientAppTypes": [
      "all"
    ],
    "ClientApplications": {
      "ExcludeServicePrincipals": null,
      "IncludeServicePrincipals": null,
      "ServicePrincipalFilter": {
        "Mode": null,
        "Rule": null
      }
    },
    "Devices": {
      "DeviceFilter": {
        "Mode": null,
        "Rule": null
      }
    },
    "InsiderRiskLevels": null,
    "Locations": {
      "ExcludeLocations": null,
      "IncludeLocations": null
    },
    "Platforms": {
      "ExcludePlatforms": [
        "iOS"
      ],
      "IncludePlatforms": [
        "all"
      ]
    },
    "ServicePrincipalRiskLevels": [],
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": [],
      "ExcludeGuestsOrExternalUsers": {
        "ExternalTenants": {
          "MembershipKind": null
        },
        "GuestOrExternalUserTypes": null
      },
      "ExcludeRoles": [],
      "ExcludeUsers": [],
      "IncludeGroups": [
        "d01fa477-f6c1-4e8c-bd6b-c10b1edabaf7"
      ],
      "IncludeGuestsOrExternalUsers": {
        "ExternalTenants": {
          "MembershipKind": null
        },
        "GuestOrExternalUserTypes": null
      },
      "IncludeRoles": [],
      "IncludeUsers": []
    }
  },
  "CreatedDateTime": "2025-08-04T17:58:26.5333214Z",
  "Description": null,
  "DisplayName": "CAP00a - All Resources: Require MFA for Team_iOS Registration on all devices except iOS",
  "GrantControls": {
    "AuthenticationStrength": {
      "AllowedCombinations": [
        "windowsHelloForBusiness",
        "fido2",
        "temporaryAccessPassOneTime",
        "password,microsoftAuthenticatorPush",
        "password,softwareOath",
        "password,hardwareOath"
      ],
      "CombinationConfigurations": [
        {
          "AppliesToCombinations": [
            "fido2"
          ],
          "Id": "7313bdbd-3952-48d8-bbf7-329d8dadb4e2"
        }
      ],
      "CreatedDateTime": "2025-05-15T13:04:34.7433055Z",
      "Description": "Requirements for GSA MFA",
      "DisplayName": "GS MFA",
      "Id": "e3027f75-f48f-4696-ae56-361d03afc308",
      "ModifiedDateTime": "2025-07-07T14:12:08.9826826Z",
      "PolicyType": "custom",
      "RequirementsSatisfied": "mfa"
    },
    "BuiltInControls": [],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": []
  },
  "Id": "f888ed52-03ae-4501-8117-1d5dc6e120d4",
  "ModifiedDateTime": "2025-08-04T17:59:54.6234297Z",
  "SessionControls": {
    "ApplicationEnforcedRestrictions": {
      "IsEnabled": null
    },
    "CloudAppSecurity": {
      "CloudAppSecurityType": null,
      "IsEnabled": null
    },
    "DisableResilienceDefaults": null,
    "PersistentBrowser": {
      "IsEnabled": null,
      "Mode": null
    },
    "SecureSignInSession": {
      "IsEnabled": null
    },
    "SignInFrequency": {
      "AuthenticationType": "primaryAndSecondaryAuthentication",
      "FrequencyInterval": "timeBased",
      "IsEnabled": true,
      "Type": "days",
      "Value": 30
    }
  },
  "State": "enabled",
  "TemplateId": null,
  "AdditionalProperties": {
    "@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies/$entity"
  }
}
