{
  "Conditions": {
    "Applications": {
      "ApplicationFilter": {
        "Mode": null,
        "Rule": null
      },
      "ExcludeApplications": [],
      "IncludeApplications": [
        "MicrosoftAdminPortals"
      ],
      "IncludeAuthenticationContextClassReferences": [],
      "IncludeUserActions": []
    },
    "AuthenticationFlows": {
      "TransferMethods": null
    },
    "ClientAppTypes": [
      "all"
    ],
    "ClientApplications": {
      "ExcludeServicePrincipals": null,
      "IncludeServicePrincipals": null,
      "ServicePrincipalFilter": {
        "Mode": null,
        "Rule": null
      }
    },
    "Devices": {
      "DeviceFilter": {
        "Mode": null,
        "Rule": null
      }
    },
    "InsiderRiskLevels": null,
    "Locations": {
      "ExcludeLocations": null,
      "IncludeLocations": null
    },
    "Platforms": {
      "ExcludePlatforms": null,
      "IncludePlatforms": null
    },
    "ServicePrincipalRiskLevels": [],
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": [],
      "ExcludeGuestsOrExternalUsers": {
        "ExternalTenants": {
          "MembershipKind": null
        },
        "GuestOrExternalUserTypes": null
      },
      "ExcludeRoles": [
        "d29b2b05-8046-44ba-8758-1e26182fcf32"
      ],
      "ExcludeUsers": [
        "8dab5fa8-e1a1-4056-adbc-9efdbfd51af9"
      ],
      "IncludeGroups": [],
      "IncludeGuestsOrExternalUsers": {
        "ExternalTenants": {
          "MembershipKind": null
        },
        "GuestOrExternalUserTypes": null
      },
      "IncludeRoles": [
        "9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3",
        "c4e39bd9-1100-46d3-8c65-fb160da0071f",
        "b0f54661-2d74-4c50-afa3-1ec803f12efe",
        "158c047a-c907-4556-b7ef-446551a6b5f7",
        "b1be1c3e-b65d-4f19-8427-f6fa0d97feb9",
        "29232cdf-9323-42fd-ade2-1d097af3e4de",
        "62e90394-69f5-4237-9190-012177145e10",
        "f2ef992c-3afb-46b9-b7cf-a126ee74c451",
        "729827e3-9c14-49f7-bb1b-9608f156bbb8",
        "966707d0-3269-4727-9be2-8c3a10f19b9d",
        "7be44c8a-adaf-4e2a-84d6-ab2649e08a13",
        "e8611ab8-c189-46e8-94e1-60213ab1f814",
        "194ae4cb-b126-40b2-bd5b-6091b380977d",
        "f28a1f50-f6e7-4571-818b-6a12f2af6b6c",
        "fe930be7-5e62-47db-91af-98c3a49a38b1"
      ],
      "IncludeUsers": []
    }
  },
  "CreatedDateTime": "2025-04-25T16:39:07.1041183Z",
  "Description": null,
  "DisplayName": "CAP11 - Microsoft Admin Portals: Enforce non-persistent browser and sign-in frequency for admin users",
  "GrantControls": {
    "AuthenticationStrength": {
      "AllowedCombinations": [
        "windowsHelloForBusiness",
        "fido2",
        "temporaryAccessPassOneTime",
        "password,microsoftAuthenticatorPush",
        "password,softwareOath",
        "password,hardwareOath"
      ],
      "CombinationConfigurations": [
        {
          "AppliesToCombinations": [
            "fido2"
          ],
          "Id": "7313bdbd-3952-48d8-bbf7-329d8dadb4e2"
        }
      ],
      "CreatedDateTime": "2025-05-15T13:04:34.7433055Z",
      "Description": "Requirements for GSA MFA",
      "DisplayName": "GS MFA",
      "Id": "e3027f75-f48f-4696-ae56-361d03afc308",
      "ModifiedDateTime": "2025-07-07T14:12:08.9826826Z",
      "PolicyType": "custom",
      "RequirementsSatisfied": "mfa"
    },
    "BuiltInControls": [],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": []
  },
  "Id": "b2e9cc7d-4f39-47a4-9544-9bd6f18f9553",
  "ModifiedDateTime": "2025-08-26T15:42:36.4091556Z",
  "SessionControls": {
    "ApplicationEnforcedRestrictions": {
      "IsEnabled": null
    },
    "CloudAppSecurity": {
      "CloudAppSecurityType": null,
      "IsEnabled": null
    },
    "DisableResilienceDefaults": null,
    "PersistentBrowser": {
      "IsEnabled": null,
      "Mode": null
    },
    "SecureSignInSession": {
      "IsEnabled": null
    },
    "SignInFrequency": {
      "AuthenticationType": "primaryAndSecondaryAuthentication",
      "FrequencyInterval": "timeBased",
      "IsEnabled": true,
      "Type": "hours",
      "Value": 4
    }
  },
  "State": "enabled",
  "TemplateId": null,
  "AdditionalProperties": {
    "@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies/$entity"
  }
}
