{
  "Conditions": {
    "Applications": {
      "ApplicationFilter": {
        "Mode": null,
        "Rule": null
      },
      "ExcludeApplications": [],
      "IncludeApplications": [
        "cc15fd57-2c6c-4117-a88c-83b1d56b4bbe",
        "00000002-0000-0ff1-ce00-000000000000",
        "Office365"
      ],
      "IncludeAuthenticationContextClassReferences": [],
      "IncludeUserActions": []
    },
    "AuthenticationFlows": {
      "TransferMethods": null
    },
    "ClientAppTypes": [
      "all"
    ],
    "ClientApplications": {
      "ExcludeServicePrincipals": null,
      "IncludeServicePrincipals": null,
      "ServicePrincipalFilter": {
        "Mode": null,
        "Rule": null
      }
    },
    "Devices": {
      "DeviceFilter": {
        "Mode": "include",
        "Rule": "device.manufacturer -contains \"poly\" -and device.model -startsWith \"CCX50\" -and device.isCompliant -eq True"
      }
    },
    "InsiderRiskLevels": null,
    "Locations": {
      "ExcludeLocations": null,
      "IncludeLocations": null
    },
    "Platforms": {
      "ExcludePlatforms": [],
      "IncludePlatforms": [
        "android"
      ]
    },
    "ServicePrincipalRiskLevels": [],
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": [],
      "ExcludeGuestsOrExternalUsers": {
        "ExternalTenants": {
          "MembershipKind": null
        },
        "GuestOrExternalUserTypes": null
      },
      "ExcludeRoles": [],
      "ExcludeUsers": [],
      "IncludeGroups": [],
      "IncludeGuestsOrExternalUsers": {
        "ExternalTenants": {
          "MembershipKind": null
        },
        "GuestOrExternalUserTypes": null
      },
      "IncludeRoles": [],
      "IncludeUsers": [
        "All"
      ]
    }
  },
  "CreatedDateTime": "2025-08-26T20:37:33.3312827Z",
  "Description": null,
  "DisplayName": "CAP22 - Teams Phones: Allow compliant phones access to designated apps with MFA",
  "GrantControls": {
    "AuthenticationStrength": {
      "AllowedCombinations": [
        "windowsHelloForBusiness",
        "fido2",
        "temporaryAccessPassOneTime",
        "password,microsoftAuthenticatorPush",
        "password,softwareOath",
        "password,hardwareOath"
      ],
      "CombinationConfigurations": [
        {
          "AppliesToCombinations": [
            "fido2"
          ],
          "Id": "7313bdbd-3952-48d8-bbf7-329d8dadb4e2"
        }
      ],
      "CreatedDateTime": "2025-05-15T13:04:34.7433055Z",
      "Description": "Requirements for GSA MFA",
      "DisplayName": "GS MFA",
      "Id": "e3027f75-f48f-4696-ae56-361d03afc308",
      "ModifiedDateTime": "2025-07-07T14:12:08.9826826Z",
      "PolicyType": "custom",
      "RequirementsSatisfied": "mfa"
    },
    "BuiltInControls": [],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": []
  },
  "Id": "f5845dd1-b659-45f4-ae74-de01c1e30a9b",
  "ModifiedDateTime": "2025-08-26T20:38:08.101112Z",
  "SessionControls": {
    "ApplicationEnforcedRestrictions": {
      "IsEnabled": null
    },
    "CloudAppSecurity": {
      "CloudAppSecurityType": null,
      "IsEnabled": null
    },
    "DisableResilienceDefaults": null,
    "PersistentBrowser": {
      "IsEnabled": null,
      "Mode": null
    },
    "SecureSignInSession": {
      "IsEnabled": null
    },
    "SignInFrequency": {
      "AuthenticationType": null,
      "FrequencyInterval": null,
      "IsEnabled": null,
      "Type": null,
      "Value": null
    }
  },
  "State": "enabled",
  "TemplateId": null,
  "AdditionalProperties": {
    "@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies/$entity"
  }
}
