{
  "Conditions": {
    "Applications": {
      "ApplicationFilter": {
        "Mode": null,
        "Rule": null
      },
      "ExcludeApplications": [],
      "IncludeApplications": [
        "All"
      ],
      "IncludeAuthenticationContextClassReferences": [],
      "IncludeUserActions": []
    },
    "AuthenticationFlows": {
      "TransferMethods": null
    },
    "ClientAppTypes": [
      "all"
    ],
    "ClientApplications": {
      "ExcludeServicePrincipals": [
        "b43aeafa-4ead-4c96-89d1-118fe563e996",
        "be49550a-1e2a-443a-8a7f-413819243906",
        "02b03dcc-8568-4ed9-afe2-83cf2c181e64",
        "23e4f54e-8321-4283-ac5c-9218722bda1d",
        "5c539277-7c8f-476d-a7c2-6bfa47a66f47",
        "bec51728-2a6c-4208-acaf-8f8074ad3430",
        "ba51342e-e26a-411e-96a2-ef3e7de3a0c4",
        "35b9477c-7510-4fde-97eb-a0d1552aff95",
        "7d25180c-6d97-40e3-a64f-2246429f2573",
        "553bd080-495e-49f4-a3d6-b5ec36e238a6",
        "3191b892-556b-4e8c-a055-25813b60200f",
        "6bc07d43-e496-4390-9754-65a0f7c8fb7b",
        "942cc314-1ed6-4f56-83ab-5f9ae71878f6",
        "c18cf8c7-f337-431d-b691-3c6080df7f0d"
      ],
      "IncludeServicePrincipals": [
        "ServicePrincipalsInMyTenant"
      ],
      "ServicePrincipalFilter": {
        "Mode": null,
        "Rule": null
      }
    },
    "Devices": {
      "DeviceFilter": {
        "Mode": null,
        "Rule": null
      }
    },
    "InsiderRiskLevels": null,
    "Locations": {
      "ExcludeLocations": [
        "AllTrusted"
      ],
      "IncludeLocations": [
        "All"
      ]
    },
    "Platforms": {
      "ExcludePlatforms": null,
      "IncludePlatforms": null
    },
    "ServicePrincipalRiskLevels": [],
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": [],
      "ExcludeGuestsOrExternalUsers": {
        "ExternalTenants": {
          "MembershipKind": null
        },
        "GuestOrExternalUserTypes": null
      },
      "ExcludeRoles": [],
      "ExcludeUsers": [],
      "IncludeGroups": [],
      "IncludeGuestsOrExternalUsers": {
        "ExternalTenants": {
          "MembershipKind": null
        },
        "GuestOrExternalUserTypes": null
      },
      "IncludeRoles": [],
      "IncludeUsers": [
        "None"
      ]
    }
  },
  "CreatedDateTime": "2025-08-22T13:55:27.4859227Z",
  "Description": null,
  "DisplayName": "CAP23 App Registrations: Block untrusted locations for app registrations without named locations",
  "GrantControls": {
    "AuthenticationStrength": {
      "AllowedCombinations": null,
      "CombinationConfigurations": null,
      "CreatedDateTime": null,
      "Description": null,
      "DisplayName": null,
      "Id": null,
      "ModifiedDateTime": null,
      "PolicyType": null,
      "RequirementsSatisfied": null
    },
    "BuiltInControls": [
      "block"
    ],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": []
  },
  "Id": "617fb266-5351-4a46-b556-92f2d58a226e",
  "ModifiedDateTime": "2025-09-12T16:51:43.569883Z",
  "SessionControls": {
    "ApplicationEnforcedRestrictions": {
      "IsEnabled": null
    },
    "CloudAppSecurity": {
      "CloudAppSecurityType": null,
      "IsEnabled": null
    },
    "DisableResilienceDefaults": null,
    "PersistentBrowser": {
      "IsEnabled": null,
      "Mode": null
    },
    "SecureSignInSession": {
      "IsEnabled": null
    },
    "SignInFrequency": {
      "AuthenticationType": null,
      "FrequencyInterval": null,
      "IsEnabled": null,
      "Type": null,
      "Value": null
    }
  },
  "State": "enabled",
  "TemplateId": null,
  "AdditionalProperties": {
    "@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies/$entity"
  }
}
